# Start Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
MemberForces..::..Start Property
MemberForces Class See Also
---
Member Forces position on analytical model stick element. True for start, false for end.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool Start { get; set; }
```

Visual Basic
---
```text
Public Property Start As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Start {
	bool get ();
	void set (bool value);
}
```

# See Also
MemberForces Class
Autodesk.Revit.DB.Structure Namespace